test/site/content-org/all-posts.org
#+HUGO_BASE_DIR: ../
#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval no
#+MACRO: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]

** Verse for indentation
:PROPERTIES:
:EXPORT_FILE_NAME: verse-for-indentation
:END:
Some text before indented text.
#+BEGIN_VERSE
>    Text indented by 4 spaces
#+END_VERSE
Org removes indentation from the first line of the text block even in
a Verse block. To get around that, the trick is to use the =>=
character before the required indentation spaces *only* on the first
non-blank line in a Verse block. Only that first =>= character is
removed when translating to Markdown.
*** More examples
- More indentation than in the above example:
  #+BEGIN_VERSE
>        Text indented by 8 spaces
#+END_VERSE
- Leading blank line followed by indented text:
  #+BEGIN_VERSE

>    Text indented by 4 spaces
#+END_VERSE
- Indented text followed by a trailing blank line:
  #+BEGIN_VERSE
>    Text indented by 4 spaces

#+END_VERSE
- Using tab characters for indentation; each tab character still
  constitutes for one =&nbsp;= in HTML.
  #+BEGIN_VERSE
>				Text indented by 4 tab characters
#+END_VERSE
*** Corner cases
Only the *first* =>= character immediately following spaces and empty
lines will be removed:
#+BEGIN_VERSE

>Line 1 above was empty. So the first =>= seen on this line is removed.
Line 3 had no =>= char.
> ← See that this =>= on line 4 is retained even at the beginning of the line.
Line 5 has this > charcter in-between and is retained.
#+END_VERSE

If someone really wants to have =>= as the first non-blank character
in the final output, they can use =>>= instead.. *only for that first
instance*. The below Verse block is same as above except that the
first =>= is retained in the final output.
#+BEGIN_VERSE

>>Line 1 above was empty. So *only* the first =>= seen on this line is removed.
Line 3 had no =>= char.
> ← See that this =>= on line 4 is retained even at the beginning of the line.
Line 5 has this > charcter in-between and is retained.
#+END_VERSE
